old_assignment/app/controllers/cards_controller.rb

	def new
		@card = Card.new
		@user = User.all
---
SELECT "users".* FROM "users"

	def create
		@user = current_user
		card = Card.create(card_params)
---
INSERT INTO "cards" ("number", "cardtype", "expires_month", "expires_year", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def show
		@card = Card.find(params[:id])
		@ownership = UserCard.find_by(user_id: 1, card_id: @card.id)
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_cards".* FROM "user_cards" WHERE "user_cards"."user_id" = ? AND "user_cards"."card_id" = ? LIMIT 1  [["user_id", 1], ["card_id", 1]]

	def destroy
		Card.find(params[:id]).destroy
---
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 8]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", 8]]