old_assignment/app/controllers/sessions_controller.rb

	def create
		result = User.all.where(
			email: params[:email], password: params[:password]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" IS NULL  ORDER BY "users"."id" ASC LIMIT 1  [["email", "tejk@gjk.com"]]