old_assignment/app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["fname", "Troy"], ["lname", "starwalt"], ["email", "tro@gmail.com"], ["password", "slayer"], ["created_at", "2015-10-26 19:16:48.048579"], ["updated_at", "2015-10-26 19:16:48.048579"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
	def destroy
		User.find(params[:id]).destroy