old_assignment/app/controllers/user_cards_controller.rb

INSERT INTO "user_cards" ("user_id", "card_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["card_id", 3], ["created_at", "2015-10-30 16:07:14.532059"], ["updated_at", "2015-10-30 16:07:14.532059"]]
---
	def create
		puts "UsersCardsController.create()"

SELECT "user_cards".* FROM "user_cards"
---
	def index
		@user_cards = UserCard.all