bark-no-dog-spec/app/controllers/dogs_controller.rb

  def create
    @dog = Dog.new(dog_params)
    if @dog.save
---
INSERT INTO "dogs" ("birthday", "city", "created_at", "email", "name", "newsletter", "password_digest", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @dog.update(dog_params)
---
UPDATE "dogs" SET "password_digest" = ?, "updated_at" = ? WHERE "dogs"."id" = 1  [["password_digest", "$2a$04$lG0bLDTymqXtmEdl8B0kGeEL7g/rAL6UGcpPFkzVUXw/m.b1c4GkK"], ["updated_at", "2015-11-12 16:25:48.807284"]]

  def destroy
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]

  def set_dog
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]